{
  "questions": {},
  "knowledge": {
    "What is your name?": "My name is lisa.",
    "Who devoleped you?": "MysticMoon",
    "How are you?": "I'm doing well, thank you for asking!",
    "What can you do?": "I can answer questions, provide information, and learn from you!",
    "Tell me a joke.": "Why don't scientists trust atoms? Because they make up everything!",
    "What's the capital of France?": "The capital of France is Paris.",
    "Who is the president of the United States?": "As of now, the president of the United States is Joe Biden.",
    "What is the meaning of life?": "The meaning of life is a philosophical question that has different interpretations. Some believe it's about finding happiness and fulfillment, while others see it as a quest for knowledge and understanding.",
    "Can you teach me something new?": "Sure! Did you know that the Earth's atmosphere is composed of approximately 78% nitrogen, 21% oxygen, and 1% other gases?",
    "What is the square root of 144?": "The square root of 144 is 12.",
    "Who wrote 'Romeo and Juliet'?": "William Shakespeare wrote 'Romeo and Juliet'.",
    "What is the tallest mountain in the world?": "Mount Everest is the tallest mountain in the world, with a height of 8,848.86 meters (29,031.7 feet) above sea level.",
    "How many continents are there?": "There are seven continents: Africa, Antarctica, Asia, Europe, North America, Australia (Oceania), and South America.",
    "What is the largest ocean in the world?": "The largest ocean in the world is the Pacific Ocean.",
    "What is the boiling point of water?": "The boiling point of water is 100 degrees Celsius (212 degrees Fahrenheit) at standard atmospheric pressure.",
    "Who painted the Mona Lisa?": "Leonardo da Vinci painted the Mona Lisa.",
    "What is the speed of light?": "The speed of light in a vacuum is approximately 299,792 kilometers per second (186,282 miles per second).",
    "What is the capital of Japan?": "The capital of Japan is Tokyo.",
    "Who discovered penicillin?": "Alexander Fleming discovered penicillin in 1928.",
    "What is the chemical symbol for water?": "The chemical symbol for water is H2O.",
    "What is the largest planet in our solar system?": "The largest planet in our solar system is Jupiter.",
    "What is the national animal of Australia?": "The national animal of Australia is the kangaroo.",
    "What is the meaning of 'carpe diem'?": "'Carpe diem' is a Latin phrase that means 'seize the day' or 'enjoy the present moment without worrying about the future'.",
    "Who invented the telephone?": "Alexander Graham Bell is credited with inventing the telephone.",
    "What is the currency of Canada?": "The currency of Canada is the Canadian dollar.",
    "Who is the author of 'Harry Potter' series?": "J.K. Rowling is the author of the 'Harry Potter' series.",
    "What is the tallest building in the world?": "The tallest building in the world is the Burj Khalifa in Dubai, United Arab Emirates.",
    "hi": "Hello"
  }
}